<template lang="pug">
div.stubContainer
  text-block(title="Раздвижные системы" v-bind:h1="true")
    p.
      Раздвижные двери из стекла представляют собой очень презентабельные и современные элементы декора. Отличительной чертой раздвижных систем является то, что они не занимают комнатное пространство. Так как сама дверь открывается за счет стены, она не занимает комнатного пространства. Именно поэтому раздвижные системы – это лучшая альтернатива обычным дверям. Они непросто аккуратно и модно смотрятся, но и являются удобной и практической заменой традиционной двери.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="Где применяются раздвижные системы?")
    p.
      На самом деле применение раздвижных дверей намного шире, чем это может казаться. В основном, они могут применяться в качестве офисного варианта либо просто заменить межкомнатную дверь. В большей части раздвижные системы используются в качестве дверей в ванной комнате либо на кухне. Однако, это не единственное их применение. На сегодняшний день все чаще и чаще раздвижные системы из стекла стали применяться и в меблированные. Так, например, часто можно встретить шкаф-купе со стеклянной раздвижной дверью или полки-шкафы.
  text-block(title="Какие бывают стеклянные раздвижные системы? ")
    p.
      Благодаря современным технологиям и навыкам раздвижные двери  из стекла могут быть непросто удобной альтернативой обычным дверям, но и соответствовать всем вашим запросам и дизайнерским задумкам. Наш магазин предоставляет огромный выбор самых разных раздвижных систем на любой вкус и под любые запросы.
    ul
      li Матовые раздвижные двери – удобны и практичны, они чаще всего употребляются в качестве дверей в ванную комнату, так как абсолютно не просвечивают.
      li Цветные раздвижные двери – отличное решение для мебели. Оттенки и тона можно подобрать под цвет и дизайн шкафа, сочетать с другими предметами вашего интерьера.
    p Раздвижные двери с рисунком  являются одним из наиболее современных и интересных вариантов. С помощью качественной фотопечати наши специалисты наносят любые рисунки и узоры на стеклянную раздвижную дверь.
  text-block(title="Где купить раздвижные двери в Севастополе? ")
    p Заказать раздвижные двери в Севастополе вы сможете непосредственно в нашем магазине «Мир Зеркала». Все представленные выше варианты имеются в наличии нашего ассортимента, а менеджеры и консультанты компании с любовью ответят на все ваши вопросы и помогут подобрать именно нужный для вас вариант.
    p Мы с уважением относимся к запросам своих покупателей и гарантируем высокое качество не только товара, но и обслуживания.
  text-block(title="В чем наши преимущества перед конкурентами?  ")
    p Мы быстро рассчитаем вам приблизительную стоимость вашей покупки, проконсультируем вас, а в случае, если цена сильно будет превышать ожидания, подскажем, на чем именно можно сэкономить.
    p Весь товар, который мы предоставляем своим покупателям, делается из самых высококачественных материалов. Мы гарантируем долговечное использование, абсолютную надежность и качество каждой детали.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Раздвижные системы под заказ в Севастополе' + ' - Мир стекла и зеркал',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление раздвижных систем из стекла в Севастополе по доступным ценам, широкий ассортимент, качественная работа по доступным ценам.' },
          { hid: 'keywords', name: 'keywords', content: 'Стеклянные раздвижные системы, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpeg',
          'filter': 'anim'
        },
        {
          'name': '5.jpg',
          'filter': 'anim'
        },
        {
          'name': '6.jpg',
          'filter': 'anim'
        },
        {
          'name': '7.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: 'img/stub/StubCupboards/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
