<template lang="pug">
div.stubContainer
  text-block(title="Рисунки на стекле "  v-bind:h1="true")
    p Несмотря на то, что стекло является одним из наиболее практичных материалов в изготовке разновидных изделий, однако его внешний вид довольно-таки ограничен и однообразен. Именно поэтому в большинстве случаев в процессе выполнения дизайнерских идей, появляется необходимость более ярких решений. Одним из немногих вариантов является нанесение рисунков на стекло.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="Зачем нужны рисунки на стекле?")
    ul
      li Во-первых,  рисунки на стекле помогают воплотить в реальность любую авторскую задумку, при этом подразумевают совсем небольшие затраты, а предоставляют стильный и современный результат.
      li Во-вторых, часто некоторые компании и организации в целях продвижения своего бизнеса находят нужным нанести свои логотипы на большее количество предметов интерьера в своих помещениях.
  text-block(title="Как наносится рисунок на стекло? ")
    p На сегодняшний день существует несколько видов нанесения рисунка на стеклянный предмет. Это можно сделать вручную либо с помощью фотопечати.
    p Первые вариант представляет довольно-таки сложный процесс, подразумевающий большие временные затраты и усилия и практикуется намного реже, нежели фотопечать.
    p Фотопечать на стекле представляет собой самый популярный и современный способ нанесения рисунка на стеклянную поверхность. В сравнении с ручным способом процесс подразумевает меньшие затраты и усилия и является сравнительно недорогим.
    p Фотопечать на стекле позволяет наносить рисунок, как на всю поверхность стекла, так и на отдельные небольшие ее части. В данном случае все зависит от потребностей и запросов заказчика.
  text-block(title="Где в Севастополе сделать фотопечать на стекле?")
    p Нанести рисунок на стекло в Севастополе можно в нашем магазине «Мир стекла и зеркал». Вот уже долгое время наши специалисты практикуются в данном направлении и имеют огромный опыт, накопленный годами.
    p Фотопечать может производиться несколькими способами, однако некоторые из них давно устарели, но продолжают практиковаться и по сей день. В большинстве случаев устаревшие методы фотопечати используют организации, не имеющие современных технологий. Старые методы фотопечати занимают намного больше времени и подразумевают большие затраты ресурсов. Именно поэтому мы рекомендуем обращаться именно к нам, ведь вся технология нашего магазина соответствует современным стандартам, что помогает нашим специалистам справиться с задачей качественнее и быстрее остальных.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Рисунки на стекле в Севастополе под заказ - Мир стекла и зеркал',
        meta: [
          { hid: 'description', name: 'description', content: 'Нанесение рисунка на стекло в Севастополе с помощью пескоструйного оборудования. Поможем подобрать подходящий рисунок. Качество и приемлимую цену гарантируем.' },
          { hid: 'keywords', name: 'keywords', content: 'Рисунки на стекле, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpeg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: 'img/stub/StubGlassPaint/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
