<template lang="pug">
div.stubContainer
  text-block(title="Зеркала" v-bind:h1="true")
    p Еще с самых древних времен зеркало считалось мистическим и таинственным материалом, вокруг которого слагались мифы и легенды. Однако в современном мире, зеркала стали незаменимой частью интерьера и широко используются в самых разных областях.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    lightbox(
      ref="lightbox"
      v-bind:images="images"
      v-bind:filter="galleryFilter"
      v-bind:directory="thumbnailDir"
      v-bind:timeoutDuration="5000"
      )
  text-block(title="Какие зеркала мы предоставляем? ")
    p Настенные зеркала, пожалуй, можно считать самым распространенным вариантом. Обычно такие зеркала используются в комнатах, а помимо основной цели, имеют и важную декоративную функцию. Мы предоставляем самое большое разнообразие настенных зеркал. Это могут быть зеркала с рамами или без, овальной, квадратной или прямоугольной формы. В данном случае все зависит от потребностей покупателя.
    p Зеркала в ванную комнату также относятся к не менее распространенным вариантам, так как присутствуют практически во всех квартирах и домах. Однако зачастую бывают ситуации, когда стандартные зеркала из магазинов не подходят вашей дизайнерской задумке. Именно поэтому мы предлагаем изготовление ванного зеркала на заказ в Севастополе. Наши специалисты в самые короткие сроки смогут исполнить практически любое требование клиента из качественных и долговечных материалов.
    p Зеркала в спортивные и танцевальные залы в Севастополе также можно заказать в магазине «Мир стекла и зеркал». Мы одни из первых и наиболее успешных компаний в Севастополе, которые делают зеркала на заказ для спортивных помещений. В магазине «Мир стекла и зеркал» вы сможете заказать стекла для вашего зала, вне зависимости от размера помещения. Мы выполняем работу на заказ и выполняем, поставленные перед собой задачи качественно в самые короткие сроки.
    p Зеркальный шкаф – это еще один современный вариант, который непросто украсит ваш интерьер, но и будет очень удобным элементом вашей комнаты. Ведь, во-первых, имея зеркальный шкаф, можно не устанавливать зеркало на стену. А во-вторых, такие зеркала обычно бывают по размеру дверей шкафа и очень удобны в плане того, что зеркало отражает вас во весь рост.
  text-block(title="Где в Севастополе купить зеркала? ")
    p Заказать зеркала в Севастополе вы сможете в нашем магазине «Мир стекла и зеркал». В отличие от конкурентов, мы предоставляем огромный выбор вариаций для своих клиентов. Вы можете заказать зеркала любых размеров и форм. Более того в нашем магазине доступны и варианты зеркал с фотопечатью. С помощью фотопечати наши специалисты нанесут любой рисунок и узор на ваше зеркало. Это поможет воплотить в жизнь любую дизайнерскую задумку либо просто придать уют и комфорт любимой квартире.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Купить зеркало в Севастополе' + ' - Мир стекла и зеркал',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление зеркал на заказ в Севастополе. Качественно, быстро. Уникальный дизайн по приемлемой цене, который впишется в ваш интерьер. Выполним доставку и установку.' },
          { hid: 'keywords', name: 'keywords', content: 'Зеркала, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpeg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.JPG',
          'filter': 'anim'
        },
        {
          'name': '6.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: process.env.baseUrl + '/img/stub/StubMirror/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
