<template lang="pug">
div.stubContainer
  text-block(title="Зеркальное панно" v-bind:h1="true")
    p Одним из наиболее популярных приемов в оформление современного дизайна интерьера является зеркальное панно. Панно представляет собой своеобразную мозаику, которая конструируется из отдельных частей зеркала. Обычно это разные геометрические фигуры из зеркала, которые собираются в одно целое, составляя полноценное изображение.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="В каких случаях актуально применение зеркального панно в дизайне интерьера? ")
    p В большинстве случаев зеркальное панно применяется в дизайне интерьера разных организаций и офисных помещений. Однако на сегодняшний день композиции из зеркальных фигур все чаще встречаются в качестве декораций современных квартир и домов. Это обусловлено тем, что зеркальное панно является отличным вариантом для воплощения самых ярких дизайнерских идей, а зеркала легко вписываются в любую задумку, не принуждая ни к чему. Более того, заказать зеркальное панно вы сможете не просто, выбирая геометрические фигуры, из которых будет состоять композицию, но и с нанесенными на зеркала разновидными рисунками на ваш вкус.
  text-block(title="В чем преимущество зеркального панно? ")
    p На самом деле, помимо декоративного назначения зеркальное панно имеет и ряд преимуществ, в сравнение с декорациями из других материалов.
    ul
      li Во-первых, зеркала предают большее освещение помещению, распространяя свет и отражая разные концы вашей комнаты.
      li Во-вторых, зеркальное панно – это отличный вариант визуально увеличить площадь вашего помещения и сделать ее сделать геометрию вашей комнаты намного интереснее.
      li В-третьих, зеркала просты в очистке, они устойчивы к средствам бытовой химии и не требуют особого ухода и сильных временных затрат.
  text-block(title="Где в Севастополе приобрести зеркальное панно? ")
    p Купить зеркальное панно в Севастополе вы можете в нашем магазине «Мир стекла и зеркал». В отличие от конкурентов, мы предлагаем самые разные варианты на любой вкус и запросы клиенты. Наши опытные специалисты готовы рассмотреть все ваши требования и помочь вам с выбором подходящего для вас варианта.
    p Также вы можете заказать зеркальное панно в Севастополе, при этом сделать его намного интереснее и украсить разновидными рисунками с помощью фотопечати. Наш опыт насчитывает множество довольных клиентов, а мы всегда рады по максимуму удовлетворить ваши запросы, потому что ценим ваше доверия и любим свою работу.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Купить зеркальные панно в Севастополе под заказ',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление зеркального панно под заказ в Севастополе. Любых размеров и сложности. Качественная и быстрая работа по приемлемой цене.' },
          { hid: 'keywords', name: 'keywords', content: 'Зеркальное панно, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpg',
          'filter': 'anim'
        },
        {
          'name': '6.jpg',
          'filter': 'anim'
        },
        {
          'name': '7.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: process.env.baseUrl + 'img/stub/StubMirrorPanels/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
