<template lang="pug">
div.stubContainer
    text-block(title="Стеклаянные перегородки" v-bind:h1="true")
      p.
        Сегодня, гуляя по различным торговым центрам, посещая банки и офисные помещения,
        мы все чаще можем заметить, что комнаты отделяются друг от друга не каменными стенами,
        а стеклом. Это делается за счет стеклянных перегородок, которые идеально подходят
        в качестве замены обычных стен и имеют массу преимуществ.
    text-block(title="Примеры наших работ")
      img.exampleImg(
        v-for="(thumb, index) in images"
        v-bind:key="index"
        v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
        @click="showLightbox(thumb.name)"
        v-bind:src="thumbnailDir + thumb.name"
        v-bind:alt="thumb.alt"
        v-bind:title="thumb.alt"
        )
      no-ssr
        lightbox(
          ref="lightbox"
          v-bind:images="images"
          v-bind:filter="galleryFilter"
          v-bind:directory="thumbnailDir"
          v-bind:timeoutDuration="5000"
          )
    text-block(title="В чем преимущества стеклянных перегородок?")
      p.
        На самом деле стеклянные перегородки – это непросто достойный аналог обычным стенам,
        но и более выгодный и удобный. С одной стороны в ценовом соотношении стеклянные
        перегородки намного дешевле, нежели установка обычных стен. С другой, перегородки
        из стекла непросто быстро и легко устанавливаются, но и могут быть перемещены в
        любой момент без всякой сложности. Это в свою очередь позволяет уменьшить и
        увеличить комнату, которую они обрамляют. Такой вариант отлично подходит для
        ярмарок и торговых центров, где магазины сдаются по квадратным метрам.
        Однако в наши дни все чаще и чаще стеклянные перегородки стали использоваться и в квартирах.
        Ведь помимо всех вышеперечисленных критериев, стекло еще и визуально увеличивает помещение,
        тем самым придает ему еще более богатый вид. А очищать легко, при этом не стоит заморачиваться с
        вариантами очистки, а можно просто протереть влажной тряпкой.
    text-block(title="Какими бывают стеклянные перегородки?")
      p.
        Наиболее распространенные варианты стеклянных перегородок – это каркасные и бескаркасные.
        Оба варианта имеют свои отличие, однако ничем не уступают друг другу.
        Каркасные перегородки бывают обычно выполнены из тонкого стекла, а вся тяжесть и
        нагрузка падает на раму, которая обрамляет их. Это отличный вариант создать изолированное
        помещение, в котором легко сохраняется тепло комнаты, и изолируются посторонние шумы.
        Бескаркасные либо цельностеклянные перегородки – выполняются из толстого или многослойного
        стекла и крепятся с помощью специальных креплений. Этот вариант в большей степени
        практикуется в небольших помещениях, придавая им легкий и просторный вид.
    text-block(title="Купить стеклянные перегородки в Севастополе?")
      p.
        Хотите заказать стеклянные перегородки в Севастополе, тогда воспользуйтесь
        услугами нашего магазина «Мир стекла и зеркал». Мы предлагаем своим клиентам
        самые разные варианты стеклянных перегородок, которые легко впишутся в дизайн
        любого помещения, не принуждая к дополнительным расходам.

</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Заказать стеклянные перегородки в Севастополе',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление стеклянных перегородок в городе Севастополь на заказ. Широкий выбор видов стекла и типов перегородок по приемлемой цене.' },
          { hid: 'keywords', name: 'keywords', content: 'Стеклянные перегородоки, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
              {
                'name': '1.jpg',
                'filter': 'anim'
              },
              {
                'name': '2.jpg',
                'filter': 'anim'
              },
              {
                'name': '3.jpg',
                'filter': 'anim'
              },
              {
                'name': '4.jpg',
                'filter': 'anim'
              },
              {
                'name': '5.jpeg',
                'filter': 'anim'
              },
              {
                'name': '6.jpg',
                'filter': 'anim'
              },
              {
                'name': '7.jpg',
                'filter': 'anim'
              }
            ],
      galleryFilter: 'all',
      thumbnailDir: '/img/stub/StubPartitionImg/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
