<template lang="pug">
div.stubContainer
  text-block(title="Ремонт мебели из стекла" v-bind:h1="true")
    p Стекло является одним из наиболее практичных и удобных материалов, который украшает мебель и легко вписывается в любой интерьер. Однако очень часто, вследствие непредвиденных обстоятельств, стекло может повредиться. Это может быть обычная трещина, скол и даже полная поломка стекла. Но что делать, есть поврежденный предмет вашего интерьера, был вам дорог или просто нет возможности заменить на другой вариант?
    p Решение есть всегда! Наша компания «Мир стекла и зеркал» предлагает замену стекол любой сложности в Севастополе в самые короткие сроки. Наши специалисты быстро ответят на все интересующие вас вопросы, помогут найти альтернативное решение и изготовить замену стекла на заказ.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="В чем преимущества ремонта мебели из стекла? ")
    p На самом деле отремонтировать стеклянную мебель всегда намного проще, нежели заменить новой. Дело в том, что ремонт мебели подразумевает лишь замену поврежденной части стекла, тогда как остальные составляющие остаются не тронутыми. Данный очень удобен тем, что, во-первых, работа производится в самые короткие сроки, а во-вторых, подразумевает меньшие затраты, нежели покупка новой мебели.
  text-block(title="Какую мебель мы ремонтируем?")
    p Наш магазин «Мир стекла и зеркал» предлагает ремонт любой мебели, имеющей элементы стекла. Это могут быть шкафы, душевые кабины, скинали, стеклянные столы и даже самое обычное зеркало. Мы ремонтируем практически любое поврежденное стекло вне зависимости от объема и сложности работы.
  text-block(title="Сколько стоит ремонт стеклянной мебели в Севастополе?")
    p На самом деле цены на ремонт мебели из стекла в Севастополе зависят лишь от конкретного случая. Несомненно, ремонт стеклянной мебели всегда обходится значительно дешевле, нежели покупка новой. Наши консультанты готовы отдельно рассмотреть ваш случай и подобрать для вас подходящий вариант. А если цены вдруг превзойдут ожидания, мы готовы предложить вам и другие варианты, рассказав на которой детали можно сэкономить.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Ремонт стеклянной мебели, столов, в Севастополе',
        meta: [
          { hid: 'description', name: 'description', content: 'Выполним ремонт стеклянной мебели в Севастополе по доступной цене. Любой сложности. Широкий ассортимент стекла. Столы, шкафы, двери, окна и прочее.' },
          { hid: 'keywords', name: 'keywords', content: 'Ремонт, стекло, Севастополь' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpeg',
          'filter': 'anim'
        },
        {
          'name': '6.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: process.env.baseUrl + '/img/stub/StubRepair/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
