<template lang="pug">
div.stubContainer
  text-block(title="Стеклянные полки" v-bind:h1="true")
    p Полки являются одной из наиболее важных деталей любой комнаты. Вне зависимости от дизайна вашего интерьера, будь то навороченный хай-тек или современный минимализм, непременно возникает необходимость обзавестись полками.
    p И дело тут далеко не в дизайне. Ведь в, первую очередь полки – создают уют и комфорт, помогая раскладывать вещи по своим местам. И чем больше у вас будет полок, тем больше пространства, куда можно складывать различные вещи, в том числе, просто установить предметы декора.
    p В последнее время стеклянные полки начали все больше эксплуатироваться при оформлении дизайна квартир. А причина далеко не ограничивается привлекательностью дизайна.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="В чем преимущество полок из стекла?")
    p Стеклянные полки обладают рядом преимуществ, что позволяет им спокойно конкурировать наряду с другими материалами.
    ul
      li Во-первых, стекло устойчиво к влаге, перепадам температуры, средствам бытовой химии и т д. Этими свойствами обычно не обладает дерево и аналогичные материалы. Именно поэтому стеклянные полки никогда не сгниют, не рассохнутся и не деформируются. Они всегда будут сохранять изначальный вид.
      li Во-вторых, стекло легко подвергается очистки и не имеет свойств накапливать грязь. Обычно его достаточно подтереть влажной тряпочкой либо другими видами подручных средств.
      li В-третьих, это соотношение «цена-качество». Ведь стеклянные полки являются относительно недорогим вариантом, который прослужит вам долгие годы, оставаясь в том виде, в котором вы изначально его приобрели.
      li В-четвертых, стеклянные полки непросто стильные и хорошо вписываются в любой дизайн, но и являются довольно-таки прочным вариантом. На них можно предметы средней тяжести, например, горшки с цветами, посуду, гипсовые фигурки, книги и еще много чего.
  text-block(title="Где в Севастополе заказать стеклянные полки? ")
    p Купить стеклянные полки в Севастополе вы можете непременно в нашем магазине. Мы долгие годы практикуемся в работе со стеклом, и предоставляет своим клиентам самые разные дизайнерские идеи, которые впишутся в любой интерьер.
    p Наши консультанты с любовью ответят на все ваши вопросы и помогут найти наиболее подходящий для вас вариант. А качество нашей работы не оставит вас равнодушным. Ведь мы работает до тех пор, пока не достигаем желанного результата, оставляя лишь лучшие впечатления у своих клиентов.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Купить стеклянные полки в Севастополе' + ' - Мир стекла и зеркал',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление стеклянных полок на заказ в Севастополе по доступным ценам. Широкий ассортимент стекла, и видов полок. Выполним обмеры, доставку и установку.' },
          { hid: 'keywords', name: 'keywords', content: 'Стеклянные полки, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpg',
          'filter': 'anim'
        },
        {
          'name': '6.jpeg',
          'filter': 'anim'
        },
        {
          'name': '7.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: '/img/stub/StubShelf/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
