<template lang="pug">
div.stubContainer
  text-block(title="Витрины" v-bind:h1="true")
    p.
      Несмотря на то, что основное назначение торговой витрины – это возможность правильно и аккуратно разложить товар по полкам, есть и другое важное применение. Торговые витрины непросто представляют собой удобные стеллажи, но и показывают товар в нужном для продавца свете. Именно поэтому витрины из стекла пользуются огромным спросом и являются незаменимым, надежным и долговечным вариантом.
  text-block(title="Где купить стеклянные витрины в Севастополе? ")
    p.
      Несмотря на то, что сама конструкция стеклянных витрин подразумевает не сложный процесс, однако неожиданности могут появиться даже при работе профессионалов. Именно поэтому мы рекомендуем заказать стеклянные витрины в Севастополе в нашем магазине «Мир стекла и зеркал». Ведь наша команда профессионалов не понаслышке знает, как быстро и качественно справится с возникшей неожиданностью, чтобы не сорвать сроки на выполнение.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="В чем преимущества стеклянных витрин? ")
    p.
      Как было уже отмечено, витрина должна отображать товар в нужном для продавца свете. Именно поэтому важно подобрать вариант, в котором товар будет хорошо смотреться. Стекло – это идеальный материал, который практически не заменим в данном случае.
    p.
      Во-первых, стекло устойчиво к погодным и температурным переменам и никогда не деформируется под воздействием данных факторов. Стекло может также использоваться в холодильных витринах и, наоборот, тепличных.
    p.
      Во-вторых, под стеклом предметы отображаются намного ярче, а освещение, которое на него попадает, становится сильнее, тем самым товар будет смотреться выразительней и интересней.
    p.
      В-третьих, большой плюс стекла в том, что за ним легко ухаживать: это простота очистки и возможность полировки.
  text-block(title="Какими бывают стеклянные витрины? ")
    p.
      На сегодняшний день самым распространенными видами витрин из стекла являются:
    ul
      li Прозрачные – это витрины, выполненные из обычного прозрачного тонкого или многослойного, в зависимости от выбора клиента. Такие витрины обычно используются в продуктовых магазинах и других сферах общепита.
      li Цветные  - это витрины из цветного стекла. Они могут быть выполнены в разных тонах и оттенках. Обычно применяются в разных бутиках, ювелирных магазинах и в любых сферах деятельности, где делается акцент на дизайн витрины.
      li Матовые – это стеклянные витрины из матового стекла. Они обычно используются не для демонстрации товаров на прилавке, а, наоборот, для того, чтобы скрыть информацию от любопытных глаз.
      li Стеклянные витрины с рисунками – это один из наиболее популярных вариантов, который может использоваться практически в любой сфере деятельности. А в качестве рисунка может быть нанесен логотип предпринимателя, либо просто интересный узор для воплощения дизайнерской фантазии.
</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Купить витрину в Севастополе' + ' - Мир стекла и зеркал',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление стеклянных витрин под заказ в Севастополе. Качественная работа по приемлемой цене, обмеры, доставка, установка.' },
          { hid: 'keywords', name: 'keywords', content: 'Витрины, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpeg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpg',
          'filter': 'anim'
        },
        {
          'name': '6.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: process.env.baseUrl + '/img/stub/StubShopWindow/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
