<template lang="pug">
div.stubContainer
  text-block(title="Кухонные фартуки (скинали)" v-bind:h1="true")
    p.
      Если вы решили обновить интерьер своей кухни и даже успели прикупить новую кухонную мебель, то для совершенствования дизайна стоит обратить особое внимание и на фартук для кухни. Кухонный фартук – представляет собой стеновую панель, которая располагается между столешницей и верхними кухонными шкафами, а свойства его далеко не ограничиваются декоративными.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="Почему необходимо приобрести фартук для кухни? ")
    p.
      Покупка кухонного фартука решает сразу несколько проблем. Во-первых, кухонный фартук имеет декоративное предназначение. Он впишется в любой интерьер и сделает дизайн вашей кухни намного ярче и разнообразней. Во-вторых, фартук для кухни защищает вашу стену от всевозможных загрязнений и повреждений. Одним из наиболее распространенных и выгодных к покупке вариантов фартука для кухни является скинали. Скинали представляет собой стеклянный фартук для кухни, который на сегодняшний день считается одним из наиболее практичных и правильных вариантов.
  text-block(title="Так в чем преимущества скинали?")
    p.
      На самом деле преимущества кухонного фартука из стекла многочисленные. Мы постараемся коротко рассказать вам о том, почему стоит купить именно стеклянный фартук для кухни.
      </br>
      </br>
    ul
      li.
        Во-первых, фартук для кухни из стекла – это отличный вариант для тех, кто требователен в первую очередь к дизайну своей кухни. Ведь этот тип фартуков позволяет создать дизайн на любой вкус и цвет. В нашем магазине вы сможете заказать самые разновидные стеклянные фартуки для кухни, а также скинали с разными рисунками на стекле. При этом рисунок скинали вы можете выбрать сами.
      li.
        Во-вторых, стеклянный фартук для кухни – это непросто красиво, но и практично. Ведь выполняется он не из обычного тонкого стекла, а из нескольких слоев, наложенных друг на друга, которые не так легко повредить или сломать.
      li.
        В-третьих, скинали имеет еще одну существенную привилегию. Это простота очистки. Обычно стекло, из которого изготовляются кухонные фартуки, устойчиво к воздействиям любой бытовой химии. С другой же стороны оно не сильно притягивает грязь и очищается проще других материалов.
      li.
        В-четвертых, цены на кухонный фартук из стекла относительно невысокие. А это потому, что сам материал более доступный и легко поддается обработке.
  text-block(title="Где приобрести скинали в Севастополе? ")
    p.
      Купить скинали в Севастополе вы можете в нашем магазине «Мир стекла и зеркал», который на протяжении многих лет практикуется в создании разновидных изделий из стекла. Наши специалисты с удовольствием выслушают все ваши вопросы и помогут подобрать наилучший вариант.
    p.
      Также вы можете заказать стеклянный кухонный фартук в Севастополе с изображением разных рисунков на стекле, что придаст больший уют и сделает уникальным дизайн вашего кухонного интерьера.

</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Заказать кухонные фартуки из стекла в Севастополе',
        meta: [
          { hid: 'description', name: 'description', content: 'Изготовление кухонных фартуков в Севастополе под заказ. Широкий выбор видов стекла. Приемлемые цены, качественная работа. Выполним обмеры и установим фартуки для вашей кухни.' },
          { hid: 'keywords', name: 'keywords', content: 'Кухонные фартуки, скинали, рабочая стенка,Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpg',
          'filter': 'anim'
        },
        {
          'name': '6.jpeg',
          'filter': 'anim'
        },
        {
          'name': '7.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: process.env.baseUrl + '/img/stub/StubSkinali/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>
</style>
