<template lang="pug">
div.stubContainer
  text-block(title="Стеклаянные столы" v-bind:h1="true")
    p.
      Современные дизайнеры в своих работах все чаще используют стеклянную мебель, ведь она непросто роскошно выглядит, но и удобна в воплощении любых интерьерных задумок. Одними из наиболее интересных атрибутов стеклянной мебели являются стеклянные столы, которые актуальны, как в оформлении интерьера квартиры, так и офисного помещения.
  text-block(title="Примеры наших работ")
    img.exampleImg(
      v-for="(thumb, index) in images"
      v-bind:key="index"
      v-if="galleryFilter === 'all' || thumb.filter === galleryFilter"
      @click="showLightbox(thumb.name)"
      v-bind:src="thumbnailDir + thumb.name"
      v-bind:alt="thumb.alt"
      v-bind:title="thumb.alt"
      )
    no-ssr
      lightbox(
        ref="lightbox"
        v-bind:images="images"
        v-bind:filter="galleryFilter"
        v-bind:directory="thumbnailDir"
        v-bind:timeoutDuration="5000"
        )
  text-block(title="В чем преимущество стеклянного стола? ")
    p.
      Столы из стекла имеют множество преимуществ, которые дают возможность абсолютной конкуренции со столами из дерева и других материалов.
    ul
      li Во-первых, стеклянный стол обычно имеет внушительный вес, что придает ему максимальную надежность и устойчивость.
      li Во-вторых, стол из стекла смотрится намного роскошней и элегантней, нежели деревянный аналог.
      li В-третьих, с помощью  пескоструйной обработки на стекло может принять любой узор в сочетании с вашим дизайном.
      li В-четвертых, стеклянный стол устойчив к влаге, он практически никогда не деформируется, и будет служить вам долгие годы, никогда не теряя изначального вида.
  text-block(title="Какие бывают стеклянные столы? ")
    p.
      На самом деле любой деревянный стол, можно заменить стеклянным вариантом. На сегодняшний день самые популярные варианты стеклянных столов это:
    ul
      li Журнальные столики – данный вид стеклянных столов в большей степени имеет декоративное предназначение и используется в целях усовершенствования интерьера.
      li Обеденный стол из стекла – это непросто стильно и современно, но это еще и уникальная возможность визуально увеличить площадь вашей комнаты. Более того, стеклянную поверхность легко очищать, и она устойчива к влаге.
      li Компьютерный или письменный стол из стекла, пожалуй, один из наиболее интересных вариантов, пользующихся огромным спросом в современных офисах. Ведь такие столы непросто имеют уникальный дизайн, но и прослужат вам долгие годы, не подвергаясь деформации.
      li Кухонный стеклянный стол – это отличный вариант для хозяек, любящих готовить. Такой стол непросто имеет современный дизайн, он еще и устойчив к воздействиям бытовой химии, легок в ухаживании и не склонен накапливать загрязнения.
  text-block(title="Где купить стеклянный стол в Севастополе?")
    p.
      Наш магазин предоставляет замечательную возможность заказать стеклянный стол в Севастополе. Многие годы наши специалисты практикуются в данной области, а наш опыт насчитывает сотни довольных клиентов.
    p.
      В нашем ассортименте можно найти разные стеклянные столы на любой вкус и под любые запросы. Наш магазин «Мир стекла и зеркал» предлагает своим клиентам самые современные варианты и яркие решения.

</template>

<script>
import TextBlock from '~/components/Common/TextBlock.vue'
export default {
  head () {
    return {
        title: 'Купить стеклянные столы в Севастополе' + ' - Мир стекла и зеркал',
        meta: [
          { hid: 'description', name: 'description', content: 'Стеклянные столы под заказ в Севастополе. Проконсультируем, изготовим по уникальному дизайну. Широкий ассортимент стекла, качественная работа по доступной цене.' },
          { hid: 'keywords', name: 'keywords', content: 'Стеклянные столы, столы, Севастополь, купить, заказать, изготовить, стоимость.' },
          { hid: 'lang', name: 'lang', content: 'ru-RU' }
        ]
      }
  },
  data: function () {
    return {
      images: [
        {
          'name': '1.jpg',
          'filter': 'anim'
        },
        {
          'name': '2.jpeg',
          'filter': 'anim'
        },
        {
          'name': '3.jpg',
          'filter': 'anim'
        },
        {
          'name': '4.jpg',
          'filter': 'anim'
        },
        {
          'name': '5.jpg',
          'filter': 'anim'
        },
        {
          'name': '6.jpg',
          'filter': 'anim'
        }
      ],
      galleryFilter: 'all',
      thumbnailDir: '/img/stub/StubTable/'
    }
  },
  components: {
    'text-block': TextBlock
  },
  methods: {
    showLightbox: function (imageName) {
      this.$refs.lightbox.show(imageName)
    },
    updateFilter (filterName) {
      this.galleryFilter = filterName
    }
  }
}
</script>

<style>

</style>
